qinyunti/py32f403-nes/proj/PY32F403_HAL_Driver/Inc/py32f403_ll_sdmmc.h
#define IS_SDIO_RESPONSE(RESPONSE) (((RESPONSE) == SDIO_RESPONSE_NO)    || \
                                            ((RESPONSE) == SDIO_RESPONSE_SHORT) || \
                                            ((RESPONSE) == SDIO_RESPONSE_LONG))
/**
  * @}
  */

/** @defgroup SDIO_LL_Wait_Pend Wait pend config
  * @{
  */
#define SDIO_WAIT_PEND_DISABLE              ((uint32_t)0x00000000U)
#define SDIO_WAIT_PEND_ENABLE               SDIO_CMD_WAITPEND 

#define IS_SDIO_WAITPEND(WAIT)                  (((WAIT) == SDIO_WAIT_PEND_DISABLE) || \
                                             ((WAIT) == SDIO_WAIT_PEND_ENABLE))
/**
  * @}
  */

/** @defgroup SDIO_LL_AutoInit Send initialization sequence (80 clocks)
  * @{
  */
#define SDIO_AUTO_INIT_DISABLE              ((uint32_t)0x00000000U)
#define SDIO_AUTO_INIT_ENABLE               SDIO_CMD_AUTOINIT

#define IS_SDIO_AUTOINIT(AUTOINIT)          (((AUTOINIT) == SDIO_AUTO_INIT_DISABLE) || \
                                             ((AUTOINIT) == SDIO_AUTO_INIT_ENABLE))
/**
  * @}
  */

/** @defgroup SDIO_LL_Check_CRC  Check response crc
  * @{
  */
#define SDIO_CHECK_CRC_DISABLE              ((uint32_t)0x00000000U)
#define SDIO_CHECK_CRC_ENABLE               SDIO_CMD_CHECKRESPCRC

#define IS_SDIO_CHECKCRC(CHECKCRC)          (((CHECKCRC) == SDIO_CHECK_CRC_DISABLE) || \
                                             ((CHECKCRC) == SDIO_CHECK_CRC_ENABLE))
/**
  * @}
  */

/** @defgroup SDIO_LL_DataTransfer  Expected data transmission
  * @{
  */
#define SDIO_DATA_TRANSFER_DISABLE          ((uint32_t)0x00000000U)
#define SDIO_DATA_TRANSFER_ENABLE           SDIO_CMD_DEXPECT

#define IS_SDIO_DATATRANSFER(DEXPECT)       (((DEXPECT) == SDIO_DATA_TRANSFER_DISABLE) || \
                                             ((DEXPECT) == SDIO_DATA_TRANSFER_ENABLE))
/**
  * @}
  */

/** @defgroup SDIO_LL_CPSM_State CPSM State
  * @{
  */
#define SDIO_CPSM_DISABLE                   ((uint32_t)0x00000000U)
#define SDIO_CPSM_ENABLE                    SDIO_CMD_STARTCMD

#define IS_SDIO_CPSM(CPSM)                  (((CPSM) == SDIO_CPSM_DISABLE) || \
                                             ((CPSM) == SDIO_CPSM_ENABLE))
/**
  * @}
  */  

/** @defgroup SDIO_LL_Response_Registers Response Register
  * @{
  */
#define SDIO_RESP1                          ((uint32_t)0x00000000U)
#define SDIO_RESP2                          ((uint32_t)0x00000004U)
#define SDIO_RESP3                          ((uint32_t)0x00000008U)
#define SDIO_RESP4                          ((uint32_t)0x0000000CU)

#define IS_SDIO_RESP(RESP)                  (((RESP) == SDIO_RESP1) || \
                                             ((RESP) == SDIO_RESP2) || \
                                             ((RESP) == SDIO_RESP3) || \
                                             ((RESP) == SDIO_RESP4))
/**
  * @}
  */

/** @defgroup SDIO_LL_Data_Length Data Lenght
  * @{
  */
#define IS_SDIO_DATA_LENGTH(LENGTH) ((LENGTH) <= 0x01FFFFFFU)
/**
  * @}
  */

/** @defgroup SDIO_LL_Data_Block_Size  Data Block Size
  * @{
  */
  #define IS_SDIO_BLOCK_SIZE(SIZE) ((SIZE) < 0x00010000U) 
/**
  * @}
  */

/** @defgroup SDIO_LL_TIMEOUT  Data Block Size
  * @{
  */
  #define IS_SDIO_TIME_OUT(TIME) ((TIME) < 0x01000000U) 
/**
  * @}
  */

/** @defgroup SDIO_LL_Transfer_Direction Transfer Direction
  * @{
  */
#define SDIO_TRANSFER_DIR_TO_SDIO            ((uint32_t)0x00000000)
#define SDIO_TRANSFER_DIR_TO_CARD            SDIO_CMD_DIR

#define IS_SDIO_TRANSFER_DIR(DIR)            (((DIR) == SDIO_TRANSFER_DIR_TO_CARD) || \
                                              ((DIR) == SDIO_TRANSFER_DIR_TO_SDIO))
/**
  * @}
  */

/** @defgroup SDIO_LL_Transfer_Type Transfer Type
  * @{
  */
#define SDIO_TRANSFER_MODE_BLOCK             ((uint32_t)0x00000000U)
#define SDIO_TRANSFER_MODE_STREAM            SDIO_CMD_DTMODE

#define IS_SDIO_TRANSFER_MODE(MODE)          (((MODE) == SDIO_TRANSFER_MODE_BLOCK) || \
                                              ((MODE) == SDIO_TRANSFER_MODE_STREAM))
/**
  * @}
  */

/** @defgroup SDIO_LL_DPSM_State DPSM State
  * @{
  */
#define SDIO_DPSM_DISABLE                    ((uint32_t)0x00000000U)
#define SDIO_DPSM_ENABLE                     SDIO_DCTRL_DTEN

#define IS_SDIO_DPSM(DPSM)                   (((DPSM) == SDIO_DPSM_DISABLE) ||\
                                              ((DPSM) == SDIO_DPSM_ENABLE))
/**
  * @}
  */

/** @defgroup SDIO_LL_FIFO_Threshold FIFO Threshold
  * @{
  */
#define IS_FIFO_THRESHOLD(RX_THRESHOLD, TX_THRESHOLD) (((RX_THRESHOLD) <= 16U) &&\
                                                       ((TX_THRESHOLD) <= 16U))
/**
  * @}
  */

/** @defgroup SDIO_LL_Interrupt_sources Interrupt Sources
  * @{
  */
#define SDIO_IT_CAD                         SDIO_INTMASK_CADIE
#define SDIO_IT_RE                          SDIO_INTMASK_REIE
#define SDIO_IT_CD                          SDIO_INTMASK_CDIE
#define SDIO_IT_DTO                         SDIO_INTMASK_DTOIE
#define SDIO_IT_TXDR                        SDIO_INTMASK_TXDRIE
#define SDIO_IT_RXDR                        SDIO_INTMASK_RXDRIE
#define SDIO_IT_RCRC                        SDIO_INTMASK_RCRCIE
#define SDIO_IT_DCRC                        SDIO_INTMASK_DCRCIE
#define SDIO_IT_RTO_BAR                     SDIO_INTMASK_RTOIE
#define SDIO_IT_DRTO_BDS                    SDIO_INTMASK_DRTOIE
#define SDIO_IT_HTO                         SDIO_INTMASK_HTOIE
#define SDIO_IT_FRUN                        SDIO_INTMASK_FRUNIE
#define SDIO_IT_HLE                         SDIO_INTMASK_HLEIE
#define SDIO_IT_SBE                         SDIO_INTMASK_SBEIE
#define SDIO_IT_ACD                         SDIO_INTMASK_ACDIE
#define SDIO_IT_EBE                         SDIO_INTMASK_EBEIE
#define SDIO_IT_SDIOINT                     SDIO_INTMASK_SDIOINTIE
/**
  * @}
  */ 

/** @defgroup SDIO_LL_Flags Flags
  * @{
  */
#define SDIO_FLAG_CAD                       SDIO_INTSTS_CAD    
#define SDIO_FLAG_RE                        SDIO_INTSTS_RE     
#define SDIO_FLAG_CD                        SDIO_INTSTS_CD     
#define SDIO_FLAG_DTO                       SDIO_INTSTS_DTO    
#define SDIO_FLAG_TXDR                      SDIO_INTSTS_TXDR   
#define SDIO_FLAG_RXDR                      SDIO_INTSTS_RXDR   
#define SDIO_FLAG_RCRC                      SDIO_INTSTS_RCRC   
#define SDIO_FLAG_DCRC                      SDIO_INTSTS_DCRC   
#define SDIO_FLAG_RTO_BAR                   SDIO_INTSTS_RTO_BAR
#define SDIO_FLAG_DRTO_BDS                  SDIO_INTSTS_DRTO_BDS   
#define SDIO_FLAG_HTO                       SDIO_INTSTS_HTO    
#define SDIO_FLAG_FRUN                      SDIO_INTSTS_FRUN   
#define SDIO_FLAG_HLE                       SDIO_INTSTS_HLE    
#define SDIO_FLAG_SBE                       SDIO_INTSTS_SBE    
#define SDIO_FLAG_ACD                       SDIO_INTSTS_ACD    
#define SDIO_FLAG_EBE                       SDIO_INTSTS_EBE    
#define SDIO_FLAG_SDIOINT                   SDIO_INTSTS_SDIOINT
#define SDIO_STATIC_FLAGS                   ((uint32_t)(SDIO_FLAG_CAD | SDIO_FLAG_RE | SDIO_FLAG_CD | SDIO_FLAG_DTO |\
                                                        SDIO_FLAG_TXDR | SDIO_FLAG_RXDR | SDIO_FLAG_RCRC | SDIO_FLAG_DCRC |\
                                                        SDIO_FLAG_RTO_BAR  | SDIO_FLAG_DRTO_BDS | SDIO_FLAG_HTO |\
                                                        SDIO_FLAG_FRUN |SDIO_FLAG_HLE | SDIO_FLAG_SBE | SDIO_FLAG_ACD |\
                                                        SDIO_FLAG_EBE | SDIO_FLAG_SDIOINT))  

